
## Plan Result

[CI link](https://github.com/malachowski-labs/infrastructure/actions/runs/21111453846)


<pre><code>Plan: 3 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * argocd_application.cluster_config
  * argocd_application.traefik
  * hcloud_load_balancer_target.this
* Update
  * helm_release.argocd


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.kubernetes_secret_v1.argo_cluser_password will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_secret_v1" "argo_cluser_password" {
      + data      = (sensitive value)
      + id        = (known after apply)
      + immutable = (known after apply)
      + type      = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "argo-initial-admin-secret"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # argocd_application.cluster_config will be created
  + resource "argocd_application" "cluster_config" {
      + cascade  = true
      + id       = (known after apply)
      + status   = (known after apply)
      + validate = true
      + wait     = true

      + metadata {
          + generation       = (known after apply)
          + name             = "cluster-config"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + project                = "default"
          + revision_history_limit = 10

          + destination {
              + server = "https://kubernetes.default.svc"
            }

          + source {
              + path            = "clusters/prod.malachowski.me"
              + repo_url        = "https://github.com/malachowski-labs/manifests"
              + target_revision = "HEAD"

              + directory {
                  + recurse = true
                }
            }

          + sync_policy {
              + sync_options = [
                  + "ServerSideApply=true",
                  + "CreateNamespace=true",
                ]

              + automated {
                  + prune     = true
                  + self_heal = true
                }
            }
        }
    }

  # argocd_application.traefik will be created
  + resource "argocd_application" "traefik" {
      + cascade  = true
      + id       = (known after apply)
      + status   = (known after apply)
      + validate = true
      + wait     = true

      + metadata {
          + generation       = (known after apply)
          + name             = "argo-traefik-chart"
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + project                = "default"
          + revision_history_limit = 10

          + destination {
              + server = "https://kubernetes.default.svc"
            }

          + source {
              + path            = "traefik"
              + repo_url        = "https://github.com/traefik/traefik-helm-chart.git"
              + target_revision = "v38.0.2"

              + helm {
                  + values = <<-EOT
                        logs:
                                    general:
                                      level: INFO
                                    access:
                                      enabled: true
                                  service:
                                    annotations:
                                      load-balancer.hetzner.cloud/location: hel1
                                      load-balancer.hetzner.cloud/name: prod-malachowski-me-lb
                    EOT
                }
            }

          + sync_policy {
              + sync_options = [
                  + "CreateNamespace=true",
                ]

              + automated {
                  + prune     = true
                  + self_heal = true
                }
            }
        }
    }

  # hcloud_load_balancer_target.this will be created
  + resource "hcloud_load_balancer_target" "this" {
      + id               = (known after apply)
      + label_selector   = "role=control-plane"
      + load_balancer_id = 5553541
      + type             = "label_selector"
      + use_private_ip   = true
    }

  # helm_release.argocd will be updated in-place
  ~ resource "helm_release" "argocd" {
      ~ id                         = "argocd" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v2.13.2" -> (known after apply)
          ~ chart          = "argo-cd" -> (known after apply)
          ~ first_deployed = 1768738087 -> (known after apply)
          ~ last_deployed  = 1768738087 -> (known after apply)
          ~ name           = "argocd" -> (known after apply)
          ~ namespace      = "default" -> (known after apply)
          ~ notes          = <<-EOT
                In order to access the server UI you have the following options:
                
                1. kubectl port-forward service/argocd-server -n default 8080:443
                
                    and then open the browser on http://localhost:8080 and accept the certificate
                
                2. enable ingress in the values file `server.ingress.enabled` and either
                      - Add the annotation for ssl passthrough: https://argo-cd.readthedocs.io/en/stable/operator-manual/ingress/#option-1-ssl-passthrough
                      - Set the `configs.params."server.insecure"` in the values file and terminate SSL at your ingress: https://argo-cd.readthedocs.io/en/stable/operator-manual/ingress/#option-2-multiple-ingress-objects-and-hosts
                
                
                After reaching the UI the first time you can login with username: admin and the random password generated during the installation. You can find the password by running:
                
                kubectl -n default get secret argocd-initial-admin-secret -o jsonpath="{.data.password}" | base64 -d
                
                (You should delete the initial secret afterwards as suggested by the Getting Started Guide: https://argo-cd.readthedocs.io/en/stable/getting_started/#4-login-using-the-cli)
            EOT -> (known after apply)
          ~ revision       = 1 -> (known after apply)
          ~ values         = jsonencode({}) -> (known after apply)
          ~ version        = "7.7.11" -> (known after apply)
        } -> (known after apply)
        name                       = "argocd"
      ~ version                    = "7.7.11" -> "9.3.4"
        # (27 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.talos.hcloud_primary_ip.control_plane_ipv4[0],
  on .terraform/modules/talos/network.tf line 63, in resource "hcloud_primary_ip" "control_plane_ipv4":
  63:   datacenter    = data.hcloud_datacenter.this.name

The datacenter attribute is deprecated and will be removed after 1 July 2026.
Please use the location attribute instead. See
https://docs.hetzner.cloud/changelog#2025-12-16-phasing-out-datacenters.

(and one more similar warning elsewhere)
```

</details>



## :warning: Warnings

```hcl
Warning: Argument is deprecated

  with module.talos.hcloud_primary_ip.control_plane_ipv4[0],
  on .terraform/modules/talos/network.tf line 63, in resource "hcloud_primary_ip" "control_plane_ipv4":
  63:   datacenter    = data.hcloud_datacenter.this.name

The datacenter attribute is deprecated and will be removed after 1 July 2026.
Please use the location attribute instead. See
https://docs.hetzner.cloud/changelog#2025-12-16-phasing-out-datacenters.

(and one more similar warning elsewhere)
```



<!-- github-comment: {"Command":"plan","JobName":"infra-plan","PRNumber":8,"Program":"tfcmt","SHA1":"219a86d842002ce98785555690dd05bc057e575d","Vars":{},"WorkflowName":"infra-plan"} -->